##  OUTPUT
Terraform plan returned : 
```
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.cf.aws_cloudfront_distribution.main[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cloudfront_distribution" "main" {
      [32m+[0m [0m[1m[0maliases[0m[0m                        = [
          [32m+[0m [0m"example.com",
        ]
      [32m+[0m [0m[1m[0marn[0m[0m                            = (known after apply)
      [32m+[0m [0m[1m[0mcaller_reference[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdomain_name[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0menabled[0m[0m                        = true
      [32m+[0m [0m[1m[0metag[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mhosted_zone_id[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mhttp_version[0m[0m                   = "http2"
      [32m+[0m [0m[1m[0mid[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0min_progress_validation_batches[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mis_ipv6_enabled[0m[0m                = true
      [32m+[0m [0m[1m[0mlast_modified_time[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprice_class[0m[0m                    = "PriceClass_All"
      [32m+[0m [0m[1m[0mretain_on_delete[0m[0m               = false
      [32m+[0m [0m[1m[0mstatus[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mtags[0m[0m                           = {
          [32m+[0m [0m"Name" = "terraform testing"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m                       = {
          [32m+[0m [0m"Name" = "terraform testing"
        }
      [32m+[0m [0m[1m[0mtrusted_key_groups[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mtrusted_signers[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mwait_for_deployment[0m[0m            = false

      [32m+[0m [0mdefault_cache_behavior {
          [32m+[0m [0m[1m[0mallowed_methods[0m[0m        = [
              [32m+[0m [0m"DELETE",
              [32m+[0m [0m"GET",
              [32m+[0m [0m"HEAD",
              [32m+[0m [0m"OPTIONS",
              [32m+[0m [0m"PATCH",
              [32m+[0m [0m"POST",
              [32m+[0m [0m"PUT",
            ]
          [32m+[0m [0m[1m[0mcached_methods[0m[0m         = [
              [32m+[0m [0m"GET",
              [32m+[0m [0m"HEAD",
            ]
          [32m+[0m [0m[1m[0mcompress[0m[0m               = true
          [32m+[0m [0m[1m[0mdefault_ttl[0m[0m            = 0
          [32m+[0m [0m[1m[0mmax_ttl[0m[0m                = 0
          [32m+[0m [0m[1m[0mmin_ttl[0m[0m                = 0
          [32m+[0m [0m[1m[0msmooth_streaming[0m[0m       = false
          [32m+[0m [0m[1m[0mtarget_origin_id[0m[0m       = "some-s3-bucket-name.s3.us-east-1.amazonaws.com"
          [32m+[0m [0m[1m[0mtrusted_key_groups[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mtrusted_signers[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mviewer_protocol_policy[0m[0m = "allow-all"

          [32m+[0m [0mforwarded_values {
              [32m+[0m [0m[1m[0mheaders[0m[0m                 = [
                  [32m+[0m [0m"Origin",
                ]
              [32m+[0m [0m[1m[0mquery_string[0m[0m            = false
              [32m+[0m [0m[1m[0mquery_string_cache_keys[0m[0m = (known after apply)

              [32m+[0m [0mcookies {
                  [32m+[0m [0m[1m[0mforward[0m[0m           = "none"
                  [32m+[0m [0m[1m[0mwhitelisted_names[0m[0m = (known after apply)
                }
            }
        }

      [32m+[0m [0morigin {
          [32m+[0m [0m[1m[0mconnection_attempts[0m[0m = 3
          [32m+[0m [0m[1m[0mconnection_timeout[0m[0m  = 10
          [32m+[0m [0m[1m[0mdomain_name[0m[0m         = "some-s3-bucket-name.s3.us-east-1.amazonaws.com"
          [32m+[0m [0m[1m[0morigin_id[0m[0m           = "some-s3-bucket-name.s3.us-east-1.amazonaws.com"
        }

      [32m+[0m [0mrestrictions {
          [32m+[0m [0mgeo_restriction {
              [32m+[0m [0m[1m[0mlocations[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mrestriction_type[0m[0m = "none"
            }
        }

      [32m+[0m [0mviewer_certificate {
          [32m+[0m [0m[1m[0mcloudfront_default_certificate[0m[0m = true
          [32m+[0m [0m[1m[0mminimum_protocol_version[0m[0m       = "TLSv1"
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: terraform.text

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.text"

```